app/Http/Controllers/MarketController.php

    public function index(Request $request)
    {
        $kategori = KategoriProduk::all();

        // Get the selected category slug from the request
        $selectedKategoriSlug = $request->query('kategori');

        // Build the query for products
        $query = Produk::query();

        // If a category is selected, filter products by that category
        if ($selectedKategoriSlug) {
            $selectedKategori = KategoriProduk::where('slug', $selectedKategoriSlug)->firstOrFail();
            $query->where('kategori_id', $selectedKategori->id);
        }

        // Get recommended products with category filter if applied
        $recommendedProducts = $query->orderBy('recommended', 'desc')
            ->take(20)
            ->get();
---
select * from `kategori_produk`
select * from `produk` order by `recommended` desc limit 20

    public function detailProduk($slug)
    {
        $product = Produk::with(['ulasan', 'order_items.order'])
        ->where('slug', $slug)
        ->firstOrFail();
---
select * from `produk` where `slug` = 'susu-indomilk-putih' limit 1