app/Models/Setting.php

    public static function get($key, $default = null)
    {
        $setting = self::first();
---
select * from `settings` limit 1