app/Providers/ViewServiceProvider.php

select count(*) as aggregate from `wishlists` where `user_id` = 1
select count(*) as aggregate from `orders` where `user_id` = 1 and `status` = 'pending' and `payment_method` = 'transfer'
---
    public function boot(): void
    {
        View::composer('*', function ($view) {
            if (Auth::check()) {
                $wishlistCount = Wishlist::where('user_id', Auth::id())->count();
                $bayarCount = Orders::where('user_id', Auth::id())
                    ->where('status', 'pending')
                    ->where('payment_method', 'transfer')
                    ->count();